app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE ("categories"."parent_id" = 0)
SELECT "terms".* FROM "terms" WHERE ("terms"."category_id" = 0)
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
---
  def list
    @categories = Category.all(:conditions => {:parent_id => params[:id]})
    @terms = Term.all(:conditions => {:category_id => params[:id]})
    @parents = get_parents(params[:id])
    if params[:id].to_s != "0"
      @parent_id = Category.find(params[:id]).parent_id

INSERT INTO "categories" ("created_at", "updated_at", "name", "parent_id") VALUES ('2011-06-01 22:23:56.082403', '2011-06-01 22:23:56.082403', 'plop', 0)
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save