app/controllers/terms_controller.rb

INSERT INTO "terms" ("name", "content", "updated_at", "category_id", "created_at") VALUES ('TEST', 'TEST', '2011-06-01 22:24:14.966456', 1, '2011-06-01 22:24:14.966456')
---
  def create
    if params[:type] == ""
      redirect_to categories_path
    else
      if params.has_key?(:category_id) and params[:category_id] != "" and @current_user.categories.find(params[:category_id]) == nil
        redirect_to categories_path
      else
        @term = Term.factory(params[:type])
        if @term == nil
          redirect_to categories_path
        else
          @term.user_id = @current_user.id
          trad = "terms.#{params[:type]}"
          @term.name = "#{t(trad)}"
          if params[:category_id] != ""
            @term.category_id = params[:category_id]
          end
          if @term.save

SELECT "terms".* FROM "terms" WHERE ("terms"."id" = 2) LIMIT 1
---
  def edit
    @term = Term.find(params[:id])